# Были большие проблемы с образом в Windows при использовании dev для предсборки и app для финального образа: упорно не видел файл go.mod
# Возможно, связано с какими-то ограничениями в Windows...

# Устанавливаем базовый образ
FROM golang:1.23.2 AS builder

# Устанавливаем рабочую директорию
# НЕ СРАБОТАЛО по неизвестной причине: WORKDIR /dev
WORKDIR /app

# Копируем go.mod и go.sum в контейнер
COPY go.mod go.sum ./

# Загружаем зависимости для кэширования слоев сборки
RUN go mod download

# Копируем весь код приложения
COPY . .

# СОБЕРЕМ ОБРАЗ
RUN go build -o myapp .

# Используем образ ALPINE для запуска приложения
FROM alpine:latest

# Переносим собранное приложение в новый образ из этапа сборки
# НЕ СРАБОТАЛО: WORKDIR /app
WORKDIR /root
# НЕ СРАБОТАЛО: COPY --from=builder /dev/myapp .
COPY --from=builder /app/myapp .

# Указываем, какую команду выполнять в контейнере
CMD ["./myapp"]